GopalSaraf/Practicals/PSDL/include/proc/pic18f55q43.h
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
extern volatile unsigned char           OSCTUNE             __at(0x0B0);
#ifndef _LIB_BUILD
asm("OSCTUNE equ 0B0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TUN                    :6;
    };
    struct {
        unsigned TUN0                   :1;
        unsigned TUN1                   :1;
        unsigned TUN2                   :1;
        unsigned TUN3                   :1;
        unsigned TUN4                   :1;
        unsigned TUN5                   :1;
    };
} OSCTUNEbits_t;
extern volatile OSCTUNEbits_t OSCTUNEbits __at(0x0B0);
// bitfield macros
#define _OSCTUNE_TUN_POSN                                   0x0
#define _OSCTUNE_TUN_POSITION                               0x0
#define _OSCTUNE_TUN_SIZE                                   0x6
#define _OSCTUNE_TUN_LENGTH                                 0x6
#define _OSCTUNE_TUN_MASK                                   0x3F
#define _OSCTUNE_TUN0_POSN                                  0x0
#define _OSCTUNE_TUN0_POSITION                              0x0
#define _OSCTUNE_TUN0_SIZE                                  0x1
#define _OSCTUNE_TUN0_LENGTH                                0x1
#define _OSCTUNE_TUN0_MASK                                  0x1
#define _OSCTUNE_TUN1_POSN                                  0x1
#define _OSCTUNE_TUN1_POSITION                              0x1
#define _OSCTUNE_TUN1_SIZE                                  0x1
#define _OSCTUNE_TUN1_LENGTH                                0x1
#define _OSCTUNE_TUN1_MASK                                  0x2
#define _OSCTUNE_TUN2_POSN                                  0x2
#define _OSCTUNE_TUN2_POSITION                              0x2
#define _OSCTUNE_TUN2_SIZE                                  0x1
#define _OSCTUNE_TUN2_LENGTH                                0x1
#define _OSCTUNE_TUN2_MASK                                  0x4
#define _OSCTUNE_TUN3_POSN                                  0x3
#define _OSCTUNE_TUN3_POSITION                              0x3
#define _OSCTUNE_TUN3_SIZE                                  0x1
#define _OSCTUNE_TUN3_LENGTH                                0x1
#define _OSCTUNE_TUN3_MASK                                  0x8
#define _OSCTUNE_TUN4_POSN                                  0x4
#define _OSCTUNE_TUN4_POSITION                              0x4
#define _OSCTUNE_TUN4_SIZE                                  0x1
#define _OSCTUNE_TUN4_LENGTH                                0x1
#define _OSCTUNE_TUN4_MASK                                  0x10
#define _OSCTUNE_TUN5_POSN                                  0x5
#define _OSCTUNE_TUN5_POSITION                              0x5
#define _OSCTUNE_TUN5_SIZE                                  0x1
#define _OSCTUNE_TUN5_LENGTH                                0x1
#define _OSCTUNE_TUN5_MASK                                  0x20

// Register: OSCFRQ
#define OSCFRQ OSCFRQ
extern volatile unsigned char           OSCFRQ              __at(0x0B1);
#ifndef _LIB_BUILD
asm("OSCFRQ equ 0B1h");
#endif
// aliases
extern volatile unsigned char           OSCFREQ             __at(0x0B1);
#ifndef _LIB_BUILD
asm("OSCFREQ equ 0B1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HFFRQ                  :4;
    };
    struct {
        unsigned FRQ0                   :1;
        unsigned FRQ1                   :1;
        unsigned FRQ2                   :1;
        unsigned FRQ3                   :1;
    };
} OSCFRQbits_t;
extern volatile OSCFRQbits_t OSCFRQbits __at(0x0B1);
// bitfield macros
#define _OSCFRQ_HFFRQ_POSN                                  0x0
#define _OSCFRQ_HFFRQ_POSITION                              0x0
#define _OSCFRQ_HFFRQ_SIZE                                  0x4
#define _OSCFRQ_HFFRQ_LENGTH                                0x4
#define _OSCFRQ_HFFRQ_MASK                                  0xF
#define _OSCFRQ_FRQ0_POSN                                   0x0
#define _OSCFRQ_FRQ0_POSITION                               0x0
#define _OSCFRQ_FRQ0_SIZE                                   0x1
#define _OSCFRQ_FRQ0_LENGTH                                 0x1
#define _OSCFRQ_FRQ0_MASK                                   0x1
#define _OSCFRQ_FRQ1_POSN                                   0x1
#define _OSCFRQ_FRQ1_POSITION                               0x1
#define _OSCFRQ_FRQ1_SIZE                                   0x1
#define _OSCFRQ_FRQ1_LENGTH                                 0x1
#define _OSCFRQ_FRQ1_MASK                                   0x2
#define _OSCFRQ_FRQ2_POSN                                   0x2
#define _OSCFRQ_FRQ2_POSITION                               0x2
#define _OSCFRQ_FRQ2_SIZE                                   0x1
#define _OSCFRQ_FRQ2_LENGTH                                 0x1
#define _OSCFRQ_FRQ2_MASK                                   0x4
#define _OSCFRQ_FRQ3_POSN                                   0x3
#define _OSCFRQ_FRQ3_POSITION                               0x3
#define _OSCFRQ_FRQ3_SIZE                                   0x1
#define _OSCFRQ_FRQ3_LENGTH                                 0x1
#define _OSCFRQ_FRQ3_MASK                                   0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned HFFRQ                  :4;
    };
    struct {
        unsigned FRQ0                   :1;
        unsigned FRQ1                   :1;
        unsigned FRQ2                   :1;
        unsigned FRQ3                   :1;
    };
} OSCFREQbits_t;
extern volatile OSCFREQbits_t OSCFREQbits __at(0x0B1);
// bitfield macros
#define _OSCFREQ_HFFRQ_POSN                                 0x0
#define _OSCFREQ_HFFRQ_POSITION                             0x0
#define _OSCFREQ_HFFRQ_SIZE                                 0x4
#define _OSCFREQ_HFFRQ_LENGTH                               0x4
#define _OSCFREQ_HFFRQ_MASK                                 0xF
#define _OSCFREQ_FRQ0_POSN                                  0x0
#define _OSCFREQ_FRQ0_POSITION                              0x0
#define _OSCFREQ_FRQ0_SIZE                                  0x1
#define _OSCFREQ_FRQ0_LENGTH                                0x1
#define _OSCFREQ_FRQ0_MASK                                  0x1
#define _OSCFREQ_FRQ1_POSN                                  0x1
#define _OSCFREQ_FRQ1_POSITION                              0x1
#define _OSCFREQ_FRQ1_SIZE                                  0x1
#define _OSCFREQ_FRQ1_LENGTH                                0x1
#define _OSCFREQ_FRQ1_MASK                                  0x2
#define _OSCFREQ_FRQ2_POSN                                  0x2
#define _OSCFREQ_FRQ2_POSITION                              0x2
#define _OSCFREQ_FRQ2_SIZE                                  0x1
#define _OSCFREQ_FRQ2_LENGTH                                0x1
#define _OSCFREQ_FRQ2_MASK                                  0x4
#define _OSCFREQ_FRQ3_POSN                                  0x3
#define _OSCFREQ_FRQ3_POSITION                              0x3
#define _OSCFREQ_FRQ3_SIZE                                  0x1
#define _OSCFREQ_FRQ3_LENGTH                                0x1
#define _OSCFREQ_FRQ3_MASK                                  0x8

// Register: OSCSTAT
#define OSCSTAT OSCSTAT
extern volatile unsigned char           OSCSTAT             __at(0x0B2);
#ifndef _LIB_BUILD
asm("OSCSTAT equ 0B2h");
#endif
// aliases
extern volatile unsigned char           OSCSTAT1            __at(0x0B2);
#ifndef _LIB_BUILD
asm("OSCSTAT1 equ 0B2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLLR                   :1;
        unsigned                        :1;
        unsigned ADOR                   :1;
        unsigned SOR                    :1;
        unsigned LFOR                   :1;
        unsigned MFOR                   :1;
        unsigned HFOR                   :1;
        unsigned EXTOR                  :1;
    };
} OSCSTATbits_t;
extern volatile OSCSTATbits_t OSCSTATbits __at(0x0B2);
// bitfield macros
#define _OSCSTAT_PLLR_POSN                                  0x0
#define _OSCSTAT_PLLR_POSITION                              0x0
#define _OSCSTAT_PLLR_SIZE                                  0x1
#define _OSCSTAT_PLLR_LENGTH                                0x1
#define _OSCSTAT_PLLR_MASK                                  0x1
#define _OSCSTAT_ADOR_POSN                                  0x2
#define _OSCSTAT_ADOR_POSITION                              0x2
#define _OSCSTAT_ADOR_SIZE                                  0x1
#define _OSCSTAT_ADOR_LENGTH                                0x1
#define _OSCSTAT_ADOR_MASK                                  0x4
#define _OSCSTAT_SOR_POSN                                   0x3
#define _OSCSTAT_SOR_POSITION                               0x3
#define _OSCSTAT_SOR_SIZE                                   0x1
#define _OSCSTAT_SOR_LENGTH                                 0x1
#define _OSCSTAT_SOR_MASK                                   0x8
#define _OSCSTAT_LFOR_POSN                                  0x4
#define _OSCSTAT_LFOR_POSITION                              0x4
#define _OSCSTAT_LFOR_SIZE                                  0x1
#define _OSCSTAT_LFOR_LENGTH                                0x1
#define _OSCSTAT_LFOR_MASK                                  0x10
#define _OSCSTAT_MFOR_POSN                                  0x5
#define _OSCSTAT_MFOR_POSITION                              0x5
#define _OSCSTAT_MFOR_SIZE                                  0x1
#define _OSCSTAT_MFOR_LENGTH                                0x1
#define _OSCSTAT_MFOR_MASK                                  0x20
#define _OSCSTAT_HFOR_POSN                                  0x6
#define _OSCSTAT_HFOR_POSITION                              0x6
#define _OSCSTAT_HFOR_SIZE                                  0x1
#define _OSCSTAT_HFOR_LENGTH                                0x1
#define _OSCSTAT_HFOR_MASK                                  0x40
#define _OSCSTAT_EXTOR_POSN                                 0x7
#define _OSCSTAT_EXTOR_POSITION                             0x7
#define _OSCSTAT_EXTOR_SIZE                                 0x1
#define _OSCSTAT_EXTOR_LENGTH                               0x1
#define _OSCSTAT_EXTOR_MASK                                 0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned PLLR                   :1;
        unsigned                        :1;
        unsigned ADOR                   :1;
        unsigned SOR                    :1;
        unsigned LFOR                   :1;
        unsigned MFOR                   :1;
        unsigned HFOR                   :1;
        unsigned EXTOR                  :1;
    };
} OSCSTAT1bits_t;
extern volatile OSCSTAT1bits_t OSCSTAT1bits __at(0x0B2);
// bitfield macros
#define _OSCSTAT1_PLLR_POSN                                 0x0
#define _OSCSTAT1_PLLR_POSITION                             0x0
#define _OSCSTAT1_PLLR_SIZE                                 0x1
#define _OSCSTAT1_PLLR_LENGTH                               0x1
#define _OSCSTAT1_PLLR_MASK                                 0x1
#define _OSCSTAT1_ADOR_POSN                                 0x2
#define _OSCSTAT1_ADOR_POSITION                             0x2
#define _OSCSTAT1_ADOR_SIZE                                 0x1
#define _OSCSTAT1_ADOR_LENGTH                               0x1
#define _OSCSTAT1_ADOR_MASK                                 0x4
#define _OSCSTAT1_SOR_POSN                                  0x3
#define _OSCSTAT1_SOR_POSITION                              0x3
#define _OSCSTAT1_SOR_SIZE                                  0x1
#define _OSCSTAT1_SOR_LENGTH                                0x1
#define _OSCSTAT1_SOR_MASK                                  0x8
#define _OSCSTAT1_LFOR_POSN                                 0x4
#define _OSCSTAT1_LFOR_POSITION                             0x4
#define _OSCSTAT1_LFOR_SIZE                                 0x1
#define _OSCSTAT1_LFOR_LENGTH                               0x1
#define _OSCSTAT1_LFOR_MASK                                 0x10
#define _OSCSTAT1_MFOR_POSN                                 0x5
#define _OSCSTAT1_MFOR_POSITION                             0x5
#define _OSCSTAT1_MFOR_SIZE                                 0x1
#define _OSCSTAT1_MFOR_LENGTH                               0x1
#define _OSCSTAT1_MFOR_MASK                                 0x20
#define _OSCSTAT1_HFOR_POSN                                 0x6
#define _OSCSTAT1_HFOR_POSITION                             0x6
#define _OSCSTAT1_HFOR_SIZE                                 0x1
#define _OSCSTAT1_HFOR_LENGTH                               0x1
#define _OSCSTAT1_HFOR_MASK                                 0x40
#define _OSCSTAT1_EXTOR_POSN                                0x7
#define _OSCSTAT1_EXTOR_POSITION                            0x7
#define _OSCSTAT1_EXTOR_SIZE                                0x1
#define _OSCSTAT1_EXTOR_LENGTH                              0x1
#define _OSCSTAT1_EXTOR_MASK                                0x80

// Register: OSCEN
#define OSCEN OSCEN
extern volatile unsigned char           OSCEN               __at(0x0B3);
#ifndef _LIB_BUILD
asm("OSCEN equ 0B3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLLEN                  :1;
        unsigned                        :1;
        unsigned ADOEN                  :1;
        unsigned SOSCEN                 :1;
        unsigned LFOEN                  :1;
        unsigned MFOEN                  :1;
        unsigned HFOEN                  :1;
        unsigned EXTOEN                 :1;
    };
} OSCENbits_t;
extern volatile OSCENbits_t OSCENbits __at(0x0B3);
// bitfield macros
#define _OSCEN_PLLEN_POSN                                   0x0
#define _OSCEN_PLLEN_POSITION                               0x0
#define _OSCEN_PLLEN_SIZE                                   0x1
#define _OSCEN_PLLEN_LENGTH                                 0x1
#define _OSCEN_PLLEN_MASK                                   0x1
#define _OSCEN_ADOEN_POSN                                   0x2
#define _OSCEN_ADOEN_POSITION                               0x2
#define _OSCEN_ADOEN_SIZE                                   0x1
#define _OSCEN_ADOEN_LENGTH                                 0x1
#define _OSCEN_ADOEN_MASK                                   0x4
#define _OSCEN_SOSCEN_POSN                                  0x3
#define _OSCEN_SOSCEN_POSITION                              0x3
#define _OSCEN_SOSCEN_SIZE                                  0x1
#define _OSCEN_SOSCEN_LENGTH                                0x1
#define _OSCEN_SOSCEN_MASK                                  0x8
#define _OSCEN_LFOEN_POSN                                   0x4
#define _OSCEN_LFOEN_POSITION                               0x4
#define _OSCEN_LFOEN_SIZE                                   0x1
#define _OSCEN_LFOEN_LENGTH                                 0x1
#define _OSCEN_LFOEN_MASK                                   0x10
#define _OSCEN_MFOEN_POSN                                   0x5
#define _OSCEN_MFOEN_POSITION                               0x5
#define _OSCEN_MFOEN_SIZE                                   0x1
#define _OSCEN_MFOEN_LENGTH                                 0x1
#define _OSCEN_MFOEN_MASK                                   0x20
#define _OSCEN_HFOEN_POSN                                   0x6
#define _OSCEN_HFOEN_POSITION                               0x6
#define _OSCEN_HFOEN_SIZE                                   0x1
#define _OSCEN_HFOEN_LENGTH                                 0x1
#define _OSCEN_HFOEN_MASK                                   0x40
#define _OSCEN_EXTOEN_POSN                                  0x7
#define _OSCEN_EXTOEN_POSITION                              0x7
#define _OSCEN_EXTOEN_SIZE                                  0x1
#define _OSCEN_EXTOEN_LENGTH                                0x1
#define _OSCEN_EXTOEN_MASK                                  0x80

// Register: PRLOCK
#define PRLOCK PRLOCK
extern volatile unsigned char           PRLOCK              __at(0x0B4);
#ifndef _LIB_BUILD
asm("PRLOCK equ 0B4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRLOCKED               :1;
    };
} PRLOCKbits_t;
extern volatile PRLOCKbits_t PRLOCKbits __at(0x0B4);
// bitfield macros
#define _PRLOCK_PRLOCKED_POSN                               0x0
#define _PRLOCK_PRLOCKED_POSITION                           0x0
#define _PRLOCK_PRLOCKED_SIZE                               0x1
#define _PRLOCK_PRLOCKED_LENGTH                             0x1
#define _PRLOCK_PRLOCKED_MASK                               0x1

// Register: SCANPR
#define SCANPR SCANPR
extern volatile unsigned char           SCANPR              __at(0x0B5);
#ifndef _LIB_BUILD
asm("SCANPR equ 0B5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned SCANPR                 :3;
    };
    struct {
        unsigned SCANPR0                :1;
        unsigned SCANPR1                :1;
        unsigned SCANPR2                :1;
    };
} SCANPRbits_t;
extern volatile SCANPRbits_t SCANPRbits __at(0x0B5);
// bitfield macros
#define _SCANPR_PR_POSN                                     0x0
#define _SCANPR_PR_POSITION                                 0x0
#define _SCANPR_PR_SIZE                                     0x3
#define _SCANPR_PR_LENGTH                                   0x3
#define _SCANPR_PR_MASK                                     0x7
#define _SCANPR_PR0_POSN                                    0x0
#define _SCANPR_PR0_POSITION                                0x0
#define _SCANPR_PR0_SIZE                                    0x1
#define _SCANPR_PR0_LENGTH                                  0x1
#define _SCANPR_PR0_MASK                                    0x1
#define _SCANPR_PR1_POSN                                    0x1
#define _SCANPR_PR1_POSITION                                0x1
#define _SCANPR_PR1_SIZE                                    0x1
#define _SCANPR_PR1_LENGTH                                  0x1
#define _SCANPR_PR1_MASK                                    0x2
#define _SCANPR_PR2_POSN                                    0x2
#define _SCANPR_PR2_POSITION                                0x2
#define _SCANPR_PR2_SIZE                                    0x1
#define _SCANPR_PR2_LENGTH                                  0x1
#define _SCANPR_PR2_MASK                                    0x4
#define _SCANPR_SCANPR_POSN                                 0x0
#define _SCANPR_SCANPR_POSITION                             0x0
#define _SCANPR_SCANPR_SIZE                                 0x3
#define _SCANPR_SCANPR_LENGTH                               0x3
#define _SCANPR_SCANPR_MASK                                 0x7
#define _SCANPR_SCANPR0_POSN                                0x0
#define _SCANPR_SCANPR0_POSITION                            0x0
#define _SCANPR_SCANPR0_SIZE                                0x1
#define _SCANPR_SCANPR0_LENGTH                              0x1
#define _SCANPR_SCANPR0_MASK                                0x1
#define _SCANPR_SCANPR1_POSN                                0x1
#define _SCANPR_SCANPR1_POSITION                            0x1
#define _SCANPR_SCANPR1_SIZE                                0x1
#define _SCANPR_SCANPR1_LENGTH                              0x1
#define _SCANPR_SCANPR1_MASK                                0x2
#define _SCANPR_SCANPR2_POSN                                0x2
#define _SCANPR_SCANPR2_POSITION                            0x2
#define _SCANPR_SCANPR2_SIZE                                0x1
#define _SCANPR_SCANPR2_LENGTH                              0x1
#define _SCANPR_SCANPR2_MASK                                0x4

// Register: DMA1PR
#define DMA1PR DMA1PR
extern volatile unsigned char           DMA1PR              __at(0x0B6);
#ifndef _LIB_BUILD
asm("DMA1PR equ 0B6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :3;
    };
    struct {
        unsigned PR0                    :1;
        unsigned PR1                    :1;
        unsigned PR2                    :1;
    };
    struct {
        unsigned DMA1PR                 :3;
    };
    struct {
        unsigned DMA1PR0                :1;
        unsigned DMA1PR1                :1;
        unsigned DMA1PR2                :1;
    };
} DMA1PRbits_t;
extern volatile DMA1PRbits_t DMA1PRbits __at(0x0B6);
// bitfield macros
#define _DMA1PR_PR_POSN                                     0x0
#define _DMA1PR_PR_POSITION                                 0x0
#define _DMA1PR_PR_SIZE                                     0x3
#define _DMA1PR_PR_LENGTH                                   0x3
#define _DMA1PR_PR_MASK                                     0x7
#define _DMA1PR_PR0_POSN                                    0x0
#define _DMA1PR_PR0_POSITION                                0x0
#define _DMA1PR_PR0_SIZE                                    0x1
#define _DMA1PR_PR0_LENGTH                                  0x1
#define _DMA1PR_PR0_MASK                                    0x1
#define _DMA1PR_PR1_POSN                                    0x1
#define _DMA1PR_PR1_POSITION                                0x1
#define _DMA1PR_PR1_SIZE                                    0x1
#define _DMA1PR_PR1_LENGTH                                  0x1
#define _DMA1PR_PR1_MASK                                    0x2
#define _DMA1PR_PR2_POSN                                    0x2
#define _DMA1PR_PR2_POSITION                                0x2
#define _DMA1PR_PR2_SIZE                                    0x1
#define _DMA1PR_PR2_LENGTH                                  0x1
#define _DMA1PR_PR2_MASK                                    0x4
#define _DMA1PR_DMA1PR_POSN                                 0x0
#define _DMA1PR_DMA1PR_POSITION                             0x0
#define _DMA1PR_DMA1PR_SIZE                                 0x3
#define _DMA1PR_DMA1PR_LENGTH                               0x3
#define _DMA1PR_DMA1PR_MASK                                 0x7
#define _DMA1PR_DMA1PR0_POSN                                0x0
#define _DMA1PR_DMA1PR0_POSITION                            0x0
#define _DMA1PR_DMA1PR0_SIZE                                0x1
#define _DMA1PR_DMA1PR0_LENGTH                              0x1
#define _DMA1PR_DMA1PR0_MASK                                0x1
#define _DMA1PR_DMA1PR1_POSN                                0x1
#define _DMA1PR_DMA1PR1_POSITION                            0x1
#define _DMA1PR_DMA1PR1_SIZE                                0x1
#define _DMA1PR_DMA1PR1_LENGTH                              0x1
#define _DMA1PR_DMA1PR1_MASK                                0x2
#define _DMA1PR_DMA1PR2_POSN                                0x2
#define _DMA1PR_DMA1PR2_POSITION                            0x2
#define _DMA1PR_DMA1PR2_SIZE                                0x1
#define _DMA1PR_DMA1PR2_LENGTH                              0x1
#define _DMA1PR_DMA1PR2_MASK                                0x4

