GopalSaraf/Practicals/PSDL/include/proc/pic18f55q43.h
extern volatile RB1I2Cbits_t RB1I2Cbits __at(0x289);
// bitfield macros
#define _RB1I2C_TH_POSN                                     0x0
#define _RB1I2C_TH_POSITION                                 0x0
#define _RB1I2C_TH_SIZE                                     0x2
#define _RB1I2C_TH_LENGTH                                   0x2
#define _RB1I2C_TH_MASK                                     0x3
#define _RB1I2C_PU_POSN                                     0x4
#define _RB1I2C_PU_POSITION                                 0x4
#define _RB1I2C_PU_SIZE                                     0x2
#define _RB1I2C_PU_LENGTH                                   0x2
#define _RB1I2C_PU_MASK                                     0x30
#define _RB1I2C_SLEW_POSN                                   0x6
#define _RB1I2C_SLEW_POSITION                               0x6
#define _RB1I2C_SLEW_SIZE                                   0x2
#define _RB1I2C_SLEW_LENGTH                                 0x2
#define _RB1I2C_SLEW_MASK                                   0xC0
#define _RB1I2C_TH0_POSN                                    0x0
#define _RB1I2C_TH0_POSITION                                0x0
#define _RB1I2C_TH0_SIZE                                    0x1
#define _RB1I2C_TH0_LENGTH                                  0x1
#define _RB1I2C_TH0_MASK                                    0x1
#define _RB1I2C_TH1_POSN                                    0x1
#define _RB1I2C_TH1_POSITION                                0x1
#define _RB1I2C_TH1_SIZE                                    0x1
#define _RB1I2C_TH1_LENGTH                                  0x1
#define _RB1I2C_TH1_MASK                                    0x2
#define _RB1I2C_PU0_POSN                                    0x4
#define _RB1I2C_PU0_POSITION                                0x4
#define _RB1I2C_PU0_SIZE                                    0x1
#define _RB1I2C_PU0_LENGTH                                  0x1
#define _RB1I2C_PU0_MASK                                    0x10
#define _RB1I2C_PU1_POSN                                    0x5
#define _RB1I2C_PU1_POSITION                                0x5
#define _RB1I2C_PU1_SIZE                                    0x1
#define _RB1I2C_PU1_LENGTH                                  0x1
#define _RB1I2C_PU1_MASK                                    0x20
#define _RB1I2C_SLEW0_POSN                                  0x6
#define _RB1I2C_SLEW0_POSITION                              0x6
#define _RB1I2C_SLEW0_SIZE                                  0x1
#define _RB1I2C_SLEW0_LENGTH                                0x1
#define _RB1I2C_SLEW0_MASK                                  0x40
#define _RB1I2C_SLEW1_POSN                                  0x7
#define _RB1I2C_SLEW1_POSITION                              0x7
#define _RB1I2C_SLEW1_SIZE                                  0x1
#define _RB1I2C_SLEW1_LENGTH                                0x1
#define _RB1I2C_SLEW1_MASK                                  0x80
#define _RB1I2C_I2CTH_POSN                                  0x0
#define _RB1I2C_I2CTH_POSITION                              0x0
#define _RB1I2C_I2CTH_SIZE                                  0x2
#define _RB1I2C_I2CTH_LENGTH                                0x2
#define _RB1I2C_I2CTH_MASK                                  0x3
#define _RB1I2C_I2CPU_POSN                                  0x4
#define _RB1I2C_I2CPU_POSITION                              0x4
#define _RB1I2C_I2CPU_SIZE                                  0x2
#define _RB1I2C_I2CPU_LENGTH                                0x2
#define _RB1I2C_I2CPU_MASK                                  0x30
#define _RB1I2C_I2CSLEW_POSN                                0x6
#define _RB1I2C_I2CSLEW_POSITION                            0x6
#define _RB1I2C_I2CSLEW_SIZE                                0x2
#define _RB1I2C_I2CSLEW_LENGTH                              0x2
#define _RB1I2C_I2CSLEW_MASK                                0xC0
#define _RB1I2C_I2CTH0_POSN                                 0x0
#define _RB1I2C_I2CTH0_POSITION                             0x0
#define _RB1I2C_I2CTH0_SIZE                                 0x1
#define _RB1I2C_I2CTH0_LENGTH                               0x1
#define _RB1I2C_I2CTH0_MASK                                 0x1
#define _RB1I2C_I2CTH1_POSN                                 0x1
#define _RB1I2C_I2CTH1_POSITION                             0x1
#define _RB1I2C_I2CTH1_SIZE                                 0x1
#define _RB1I2C_I2CTH1_LENGTH                               0x1
#define _RB1I2C_I2CTH1_MASK                                 0x2
#define _RB1I2C_I2CPU0_POSN                                 0x4
#define _RB1I2C_I2CPU0_POSITION                             0x4
#define _RB1I2C_I2CPU0_SIZE                                 0x1
#define _RB1I2C_I2CPU0_LENGTH                               0x1
#define _RB1I2C_I2CPU0_MASK                                 0x10
#define _RB1I2C_I2CPU1_POSN                                 0x5
#define _RB1I2C_I2CPU1_POSITION                             0x5
#define _RB1I2C_I2CPU1_SIZE                                 0x1
#define _RB1I2C_I2CPU1_LENGTH                               0x1
#define _RB1I2C_I2CPU1_MASK                                 0x20
#define _RB1I2C_I2CSLEW0_POSN                               0x6
#define _RB1I2C_I2CSLEW0_POSITION                           0x6
#define _RB1I2C_I2CSLEW0_SIZE                               0x1
#define _RB1I2C_I2CSLEW0_LENGTH                             0x1
#define _RB1I2C_I2CSLEW0_MASK                               0x40
#define _RB1I2C_I2CSLEW1_POSN                               0x7
#define _RB1I2C_I2CSLEW1_POSITION                           0x7
#define _RB1I2C_I2CSLEW1_SIZE                               0x1
#define _RB1I2C_I2CSLEW1_LENGTH                             0x1
#define _RB1I2C_I2CSLEW1_MASK                               0x80

// Register: I2C1RXB
#define I2C1RXB I2C1RXB
extern volatile unsigned char           I2C1RXB             __at(0x28B);
#ifndef _LIB_BUILD
asm("I2C1RXB equ 028Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} I2C1RXBbits_t;
extern volatile I2C1RXBbits_t I2C1RXBbits __at(0x28B);
// bitfield macros
#define _I2C1RXB_RXB_POSN                                   0x0
#define _I2C1RXB_RXB_POSITION                               0x0
#define _I2C1RXB_RXB_SIZE                                   0x8
#define _I2C1RXB_RXB_LENGTH                                 0x8
#define _I2C1RXB_RXB_MASK                                   0xFF

// Register: I2C1TXB
#define I2C1TXB I2C1TXB
extern volatile unsigned char           I2C1TXB             __at(0x28C);
#ifndef _LIB_BUILD
asm("I2C1TXB equ 028Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} I2C1TXBbits_t;
extern volatile I2C1TXBbits_t I2C1TXBbits __at(0x28C);
// bitfield macros
#define _I2C1TXB_TXB_POSN                                   0x0
#define _I2C1TXB_TXB_POSITION                               0x0
#define _I2C1TXB_TXB_SIZE                                   0x8
#define _I2C1TXB_TXB_LENGTH                                 0x8
#define _I2C1TXB_TXB_MASK                                   0xFF

