GopalSaraf/Practicals/PSDL/include/proc/pic18f55q43.h
// Register: U3ERRIE
#define U3ERRIE U3ERRIE
extern volatile unsigned char           U3ERRIE             __at(0x2D9);
#ifndef _LIB_BUILD
asm("U3ERRIE equ 02D9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIE                  :1;
        unsigned RXFOIE                 :1;
        unsigned RXBKIE                 :1;
        unsigned FERIE                  :1;
        unsigned CERIE                  :1;
        unsigned ABDOVE                 :1;
        unsigned PERIE                  :1;
        unsigned TXMTIE                 :1;
    };
    struct {
        unsigned U3TXCIE                :1;
        unsigned U3RXFOIE               :1;
        unsigned U3RXBKIE               :1;
        unsigned U3FERIE                :1;
        unsigned U3CERIE                :1;
        unsigned U3ABDOVE               :1;
        unsigned U3PERIE                :1;
        unsigned U3TXMTIE               :1;
    };
} U3ERRIEbits_t;
extern volatile U3ERRIEbits_t U3ERRIEbits __at(0x2D9);
// bitfield macros
#define _U3ERRIE_TXCIE_POSN                                 0x0
#define _U3ERRIE_TXCIE_POSITION                             0x0
#define _U3ERRIE_TXCIE_SIZE                                 0x1
#define _U3ERRIE_TXCIE_LENGTH                               0x1
#define _U3ERRIE_TXCIE_MASK                                 0x1
#define _U3ERRIE_RXFOIE_POSN                                0x1
#define _U3ERRIE_RXFOIE_POSITION                            0x1
#define _U3ERRIE_RXFOIE_SIZE                                0x1
#define _U3ERRIE_RXFOIE_LENGTH                              0x1
#define _U3ERRIE_RXFOIE_MASK                                0x2
#define _U3ERRIE_RXBKIE_POSN                                0x2
#define _U3ERRIE_RXBKIE_POSITION                            0x2
#define _U3ERRIE_RXBKIE_SIZE                                0x1
#define _U3ERRIE_RXBKIE_LENGTH                              0x1
#define _U3ERRIE_RXBKIE_MASK                                0x4
#define _U3ERRIE_FERIE_POSN                                 0x3
#define _U3ERRIE_FERIE_POSITION                             0x3
#define _U3ERRIE_FERIE_SIZE                                 0x1
#define _U3ERRIE_FERIE_LENGTH                               0x1
#define _U3ERRIE_FERIE_MASK                                 0x8
#define _U3ERRIE_CERIE_POSN                                 0x4
#define _U3ERRIE_CERIE_POSITION                             0x4
#define _U3ERRIE_CERIE_SIZE                                 0x1
#define _U3ERRIE_CERIE_LENGTH                               0x1
#define _U3ERRIE_CERIE_MASK                                 0x10
#define _U3ERRIE_ABDOVE_POSN                                0x5
#define _U3ERRIE_ABDOVE_POSITION                            0x5
#define _U3ERRIE_ABDOVE_SIZE                                0x1
#define _U3ERRIE_ABDOVE_LENGTH                              0x1
#define _U3ERRIE_ABDOVE_MASK                                0x20
#define _U3ERRIE_PERIE_POSN                                 0x6
#define _U3ERRIE_PERIE_POSITION                             0x6
#define _U3ERRIE_PERIE_SIZE                                 0x1
#define _U3ERRIE_PERIE_LENGTH                               0x1
#define _U3ERRIE_PERIE_MASK                                 0x40
#define _U3ERRIE_TXMTIE_POSN                                0x7
#define _U3ERRIE_TXMTIE_POSITION                            0x7
#define _U3ERRIE_TXMTIE_SIZE                                0x1
#define _U3ERRIE_TXMTIE_LENGTH                              0x1
#define _U3ERRIE_TXMTIE_MASK                                0x80
#define _U3ERRIE_U3TXCIE_POSN                               0x0
#define _U3ERRIE_U3TXCIE_POSITION                           0x0
#define _U3ERRIE_U3TXCIE_SIZE                               0x1
#define _U3ERRIE_U3TXCIE_LENGTH                             0x1
#define _U3ERRIE_U3TXCIE_MASK                               0x1
#define _U3ERRIE_U3RXFOIE_POSN                              0x1
#define _U3ERRIE_U3RXFOIE_POSITION                          0x1
#define _U3ERRIE_U3RXFOIE_SIZE                              0x1
#define _U3ERRIE_U3RXFOIE_LENGTH                            0x1
#define _U3ERRIE_U3RXFOIE_MASK                              0x2
#define _U3ERRIE_U3RXBKIE_POSN                              0x2
#define _U3ERRIE_U3RXBKIE_POSITION                          0x2
#define _U3ERRIE_U3RXBKIE_SIZE                              0x1
#define _U3ERRIE_U3RXBKIE_LENGTH                            0x1
#define _U3ERRIE_U3RXBKIE_MASK                              0x4
#define _U3ERRIE_U3FERIE_POSN                               0x3
#define _U3ERRIE_U3FERIE_POSITION                           0x3
#define _U3ERRIE_U3FERIE_SIZE                               0x1
#define _U3ERRIE_U3FERIE_LENGTH                             0x1
#define _U3ERRIE_U3FERIE_MASK                               0x8
#define _U3ERRIE_U3CERIE_POSN                               0x4
#define _U3ERRIE_U3CERIE_POSITION                           0x4
#define _U3ERRIE_U3CERIE_SIZE                               0x1
#define _U3ERRIE_U3CERIE_LENGTH                             0x1
#define _U3ERRIE_U3CERIE_MASK                               0x10
#define _U3ERRIE_U3ABDOVE_POSN                              0x5
#define _U3ERRIE_U3ABDOVE_POSITION                          0x5
#define _U3ERRIE_U3ABDOVE_SIZE                              0x1
#define _U3ERRIE_U3ABDOVE_LENGTH                            0x1
#define _U3ERRIE_U3ABDOVE_MASK                              0x20
#define _U3ERRIE_U3PERIE_POSN                               0x6
#define _U3ERRIE_U3PERIE_POSITION                           0x6
#define _U3ERRIE_U3PERIE_SIZE                               0x1
#define _U3ERRIE_U3PERIE_LENGTH                             0x1
#define _U3ERRIE_U3PERIE_MASK                               0x40
#define _U3ERRIE_U3TXMTIE_POSN                              0x7
#define _U3ERRIE_U3TXMTIE_POSITION                          0x7
#define _U3ERRIE_U3TXMTIE_SIZE                              0x1
#define _U3ERRIE_U3TXMTIE_LENGTH                            0x1
#define _U3ERRIE_U3TXMTIE_MASK                              0x80

