GopalSaraf/Practicals/PSDL/include/proc/pic18f55q43.h
// Register: U4RXB
#define U4RXB U4RXB
extern volatile unsigned char           U4RXB               __at(0x2DA);
#ifndef _LIB_BUILD
asm("U4RXB equ 02DAh");
#endif
// aliases
extern volatile unsigned char           U4RXBL              __at(0x2DA);
#ifndef _LIB_BUILD
asm("U4RXBL equ 02DAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U4RXBbits_t;
extern volatile U4RXBbits_t U4RXBbits __at(0x2DA);
// bitfield macros
#define _U4RXB_RXB_POSN                                     0x0
#define _U4RXB_RXB_POSITION                                 0x0
#define _U4RXB_RXB_SIZE                                     0x8
#define _U4RXB_RXB_LENGTH                                   0x8
#define _U4RXB_RXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U4RXBLbits_t;
extern volatile U4RXBLbits_t U4RXBLbits __at(0x2DA);
// bitfield macros
#define _U4RXBL_RXB_POSN                                    0x0
#define _U4RXBL_RXB_POSITION                                0x0
#define _U4RXBL_RXB_SIZE                                    0x8
#define _U4RXBL_RXB_LENGTH                                  0x8
#define _U4RXBL_RXB_MASK                                    0xFF

// Register: U4TXB
#define U4TXB U4TXB
extern volatile unsigned char           U4TXB               __at(0x2DC);
#ifndef _LIB_BUILD
asm("U4TXB equ 02DCh");
#endif
// aliases
extern volatile unsigned char           U4TXBL              __at(0x2DC);
#ifndef _LIB_BUILD
asm("U4TXBL equ 02DCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U4TXBbits_t;
extern volatile U4TXBbits_t U4TXBbits __at(0x2DC);
// bitfield macros
#define _U4TXB_TXB_POSN                                     0x0
#define _U4TXB_TXB_POSITION                                 0x0
#define _U4TXB_TXB_SIZE                                     0x8
#define _U4TXB_TXB_LENGTH                                   0x8
#define _U4TXB_TXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U4TXBLbits_t;
extern volatile U4TXBLbits_t U4TXBLbits __at(0x2DC);
// bitfield macros
#define _U4TXBL_TXB_POSN                                    0x0
#define _U4TXBL_TXB_POSITION                                0x0
#define _U4TXBL_TXB_SIZE                                    0x8
#define _U4TXBL_TXB_LENGTH                                  0x8
#define _U4TXBL_TXB_MASK                                    0xFF

// Register: U4P1
#define U4P1 U4P1
extern volatile unsigned char           U4P1                __at(0x2DE);
#ifndef _LIB_BUILD
asm("U4P1 equ 02DEh");
#endif

// Register: U4P1L
#define U4P1L U4P1L
extern volatile unsigned char           U4P1L               __at(0x2DE);
#ifndef _LIB_BUILD
asm("U4P1L equ 02DEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1L                    :8;
    };
} U4P1Lbits_t;
extern volatile U4P1Lbits_t U4P1Lbits __at(0x2DE);
// bitfield macros
#define _U4P1L_P1L_POSN                                     0x0
#define _U4P1L_P1L_POSITION                                 0x0
#define _U4P1L_P1L_SIZE                                     0x8
#define _U4P1L_P1L_LENGTH                                   0x8
#define _U4P1L_P1L_MASK                                     0xFF

// Register: U4P2
#define U4P2 U4P2
extern volatile unsigned char           U4P2                __at(0x2E0);
#ifndef _LIB_BUILD
asm("U4P2 equ 02E0h");
#endif

// Register: U4P2L
#define U4P2L U4P2L
extern volatile unsigned char           U4P2L               __at(0x2E0);
#ifndef _LIB_BUILD
asm("U4P2L equ 02E0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
} U4P2Lbits_t;
extern volatile U4P2Lbits_t U4P2Lbits __at(0x2E0);
// bitfield macros
#define _U4P2L_P2L_POSN                                     0x0
#define _U4P2L_P2L_POSITION                                 0x0
#define _U4P2L_P2L_SIZE                                     0x8
#define _U4P2L_P2L_LENGTH                                   0x8
#define _U4P2L_P2L_MASK                                     0xFF

// Register: U4P3
#define U4P3 U4P3
extern volatile unsigned char           U4P3                __at(0x2E2);
#ifndef _LIB_BUILD
asm("U4P3 equ 02E2h");
#endif

// Register: U4P3L
#define U4P3L U4P3L
extern volatile unsigned char           U4P3L               __at(0x2E2);
#ifndef _LIB_BUILD
asm("U4P3L equ 02E2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3L                    :8;
    };
} U4P3Lbits_t;
extern volatile U4P3Lbits_t U4P3Lbits __at(0x2E2);
// bitfield macros
#define _U4P3L_P3L_POSN                                     0x0
#define _U4P3L_P3L_POSITION                                 0x0
#define _U4P3L_P3L_SIZE                                     0x8
#define _U4P3L_P3L_LENGTH                                   0x8
#define _U4P3L_P3L_MASK                                     0xFF

// Register: U4CON0
#define U4CON0 U4CON0
extern volatile unsigned char           U4CON0              __at(0x2E4);
#ifndef _LIB_BUILD
asm("U4CON0 equ 02E4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned U4MODE                 :4;
        unsigned U4RXEN                 :1;
        unsigned U4TXEN                 :1;
        unsigned U4ABDEN                :1;
        unsigned U4BRGS                 :1;
    };
    struct {
        unsigned U4MODE0                :1;
        unsigned U4MODE1                :1;
        unsigned U4MODE2                :1;
    };
    struct {
        unsigned MODE                   :4;
        unsigned RXEN                   :1;
        unsigned TXEN                   :1;
        unsigned ABDEN                  :1;
        unsigned BRGS                   :1;
    };
} U4CON0bits_t;
extern volatile U4CON0bits_t U4CON0bits __at(0x2E4);
// bitfield macros
#define _U4CON0_MODE0_POSN                                  0x0
#define _U4CON0_MODE0_POSITION                              0x0
#define _U4CON0_MODE0_SIZE                                  0x1
#define _U4CON0_MODE0_LENGTH                                0x1
#define _U4CON0_MODE0_MASK                                  0x1
#define _U4CON0_MODE1_POSN                                  0x1
#define _U4CON0_MODE1_POSITION                              0x1
#define _U4CON0_MODE1_SIZE                                  0x1
#define _U4CON0_MODE1_LENGTH                                0x1
#define _U4CON0_MODE1_MASK                                  0x2
#define _U4CON0_MODE2_POSN                                  0x2
#define _U4CON0_MODE2_POSITION                              0x2
#define _U4CON0_MODE2_SIZE                                  0x1
#define _U4CON0_MODE2_LENGTH                                0x1
#define _U4CON0_MODE2_MASK                                  0x4
#define _U4CON0_U4MODE_POSN                                 0x0
#define _U4CON0_U4MODE_POSITION                             0x0
#define _U4CON0_U4MODE_SIZE                                 0x4
#define _U4CON0_U4MODE_LENGTH                               0x4
#define _U4CON0_U4MODE_MASK                                 0xF
#define _U4CON0_U4RXEN_POSN                                 0x4
#define _U4CON0_U4RXEN_POSITION                             0x4
#define _U4CON0_U4RXEN_SIZE                                 0x1
#define _U4CON0_U4RXEN_LENGTH                               0x1
#define _U4CON0_U4RXEN_MASK                                 0x10
#define _U4CON0_U4TXEN_POSN                                 0x5
#define _U4CON0_U4TXEN_POSITION                             0x5
#define _U4CON0_U4TXEN_SIZE                                 0x1
#define _U4CON0_U4TXEN_LENGTH                               0x1
#define _U4CON0_U4TXEN_MASK                                 0x20
#define _U4CON0_U4ABDEN_POSN                                0x6
#define _U4CON0_U4ABDEN_POSITION                            0x6
#define _U4CON0_U4ABDEN_SIZE                                0x1
#define _U4CON0_U4ABDEN_LENGTH                              0x1
#define _U4CON0_U4ABDEN_MASK                                0x40
#define _U4CON0_U4BRGS_POSN                                 0x7
#define _U4CON0_U4BRGS_POSITION                             0x7
#define _U4CON0_U4BRGS_SIZE                                 0x1
#define _U4CON0_U4BRGS_LENGTH                               0x1
#define _U4CON0_U4BRGS_MASK                                 0x80
#define _U4CON0_U4MODE0_POSN                                0x0
#define _U4CON0_U4MODE0_POSITION                            0x0
#define _U4CON0_U4MODE0_SIZE                                0x1
#define _U4CON0_U4MODE0_LENGTH                              0x1
#define _U4CON0_U4MODE0_MASK                                0x1
#define _U4CON0_U4MODE1_POSN                                0x1
#define _U4CON0_U4MODE1_POSITION                            0x1
#define _U4CON0_U4MODE1_SIZE                                0x1
#define _U4CON0_U4MODE1_LENGTH                              0x1
#define _U4CON0_U4MODE1_MASK                                0x2
#define _U4CON0_U4MODE2_POSN                                0x2
#define _U4CON0_U4MODE2_POSITION                            0x2
#define _U4CON0_U4MODE2_SIZE                                0x1
#define _U4CON0_U4MODE2_LENGTH                              0x1
#define _U4CON0_U4MODE2_MASK                                0x4
#define _U4CON0_MODE_POSN                                   0x0
#define _U4CON0_MODE_POSITION                               0x0
#define _U4CON0_MODE_SIZE                                   0x4
#define _U4CON0_MODE_LENGTH                                 0x4
#define _U4CON0_MODE_MASK                                   0xF
#define _U4CON0_RXEN_POSN                                   0x4
#define _U4CON0_RXEN_POSITION                               0x4
#define _U4CON0_RXEN_SIZE                                   0x1
#define _U4CON0_RXEN_LENGTH                                 0x1
#define _U4CON0_RXEN_MASK                                   0x10
#define _U4CON0_TXEN_POSN                                   0x5
#define _U4CON0_TXEN_POSITION                               0x5
#define _U4CON0_TXEN_SIZE                                   0x1
#define _U4CON0_TXEN_LENGTH                                 0x1
#define _U4CON0_TXEN_MASK                                   0x20
#define _U4CON0_ABDEN_POSN                                  0x6
#define _U4CON0_ABDEN_POSITION                              0x6
#define _U4CON0_ABDEN_SIZE                                  0x1
#define _U4CON0_ABDEN_LENGTH                                0x1
#define _U4CON0_ABDEN_MASK                                  0x40
#define _U4CON0_BRGS_POSN                                   0x7
#define _U4CON0_BRGS_POSITION                               0x7
#define _U4CON0_BRGS_SIZE                                   0x1
#define _U4CON0_BRGS_LENGTH                                 0x1
#define _U4CON0_BRGS_MASK                                   0x80

// Register: U4CON1
#define U4CON1 U4CON1
extern volatile unsigned char           U4CON1              __at(0x2E5);
#ifndef _LIB_BUILD
asm("U4CON1 equ 02E5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SENDB                  :1;
        unsigned BRKOVR                 :1;
        unsigned                        :1;
        unsigned RXBIMD                 :1;
        unsigned WUE                    :1;
        unsigned                        :2;
        unsigned ON                     :1;
    };
    struct {
        unsigned U4SENDB                :1;
        unsigned U4BRKOVR               :1;
        unsigned                        :1;
        unsigned U4RXBIMD               :1;
        unsigned U4WUE                  :1;
        unsigned                        :2;
        unsigned U4ON                   :1;
    };
} U4CON1bits_t;
